<?php  
		 $books = array (
	 				"Рей Брэдбери" => ["451° по Фаренгейту", "Вино из одуванчиков"],
					"Грегори Дэвид Робертс" => "Шантарам", 
					"Джордж Оруэлл" => "1984", 
					"Михаил Афанасьевич Булгаков" => "Мастер и Маргарита", 
					"Эрих Мария Ремарк" => "Три товарища", 
					"Оскар Уайльд" => "Портрет Дориана Грея", 
					"Даниел Киз" => "Цветы для Элджернона", 
					"Джером Д. Сэлинджер" => "Над пропастью во ржи", 
					"Антуан де Сент-Экзюпери" => "Маленький принц", 
					"Лев Толстой" => "Анна Каренина", 
					"Габриэль Гарсиа Маркес" => "Сто лет одиночества", 
					"Грегори Дэвид Робертс" => "Тень горы", 
					"Айн Рэнд" => "Атлант расправил плечи", 
	);

	echo "Список книг с использованием тэгов списка: <br><br>";

	echo "<ol>";
	foreach ( $books as $author => $book ) {
		if ( is_array($book) ) {
			echo "<li> $author: </li>";
			echo "<ol>";
			foreach ($book as $book) {
				echo "<li> $book </li>";
			}
			echo "</ol>";
		} else {
			echo "<li> $author - $book </li>";
		}	
	}
	echo "</ol>";
?>