<?php  
	$books = array("451° по Фаренгейту", "Шантарам", "1984", "Мастер и Маргарита", "Три товарища", "Портрет Дориана Грея", "Вино из одуванчиков", "Цветы для Элджернона", "Над пропастью во ржи", "Маленький принц", "Анна Каренина", "Сто лет одиночества", "Тень горы", "Атлант расправил плечи" );

	 echo "Список книг без использования тэгов списка: <br><br>";

	 //Без тэгов списка
	 for ($i = 0; $i < count($books); $i++ ) {
	 	echo $i + 1 . "." . $books[$i]; 
	 	echo "<br>";
	 }

	 echo "<br> Список книг с использованием тэга ol: <br>";
	 //С тэгом ol
	 echo "<ol>";
	 for ($i = 0; $i < count($books); $i++ ) {
	 	echo "<li> $books[$i] </li>"; 
	 }
	 echo "</ol>";
?>